---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TemplateName
source: html/e206c37f-5af9-98b4-9e2f-312aae7a5566.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TemplateName Property

"Template"

## Syntax (C#)
```csharp
public static ForgeTypeId TemplateName { get; }
```